[{"id":1,"company":"Qualcomm (College-Sponsored Field Session)","title":"Full-Stack Developer & Scrum Master","dates":"5/12/2025 - 6/13/2025","bullets":["Architected and implemented a FastAPI-based backend with RESTful endpoints, Pydantic models, and MySQL schemas to satisfy all client requirements.","Integrated backend services to aggregate test data from several databases with a React/Vite frontend—consumed and debugged endpoints in real time to resolve cross-stack bugs and maintain seamless data flow.","Led iterative user-testing cycles, collaborating with stakeholders to refine requirements and improve prototype usability.","Served as Scrum Leader: managed weekly sprints in Jira, facilitated stand-ups, sprint planning, and retrospectives to keep the team aligned and on schedule.","Employed daily tools including GitHub, Jira, VS Code + GitHub Copilot, Microsoft Teams, sqlcmd/MySQL, Ant Design, React/TypeScript, Vite, FastAPI, and Python.","Supporting over 200 Engineers worldwide deploying millions of dollars of equipment for 5G wireless verification"]},{"id":2,"company":"WeRDigital","title":"Co-Founder","dates":"10/25/2023 - 08/05/2024","bullets":["Co-founded a studio and set up the client pipeline; from intake and discovery to proposal, scope, scheduling, delivery, and handoff so work moved predictably.","Designed and shipped small-business WordPress sites with theme customization and targeted CSS; integrated key plugins (page builders, forms, SEO, e-commerce).","Created reusable templates and SOPs for briefs, pricing tiers, and change requests; collaborated on pricing and package structure.","Led planning with founders and clients, translating goals into site structure, content priorities, and milestone plans; kept progress visible on a lightweight board.","Explored adjacent offerings (web-based phone systems, branding/identity) to expand packages and improve proposals.","Handled launch logistics end-to-end: DNS/hosting setup, basic analytics, QA checklists, and clear ownership handoff."]}]