[{"id":2,"slug":"clue","title":"Clue Game: Shopping Mall Edition","description":"A desktop adaptation of Clue implemented in pure Java AWT. The project focuses on solid object oriented design and separation of concerns: a testable rules engine (suspects, weapons, rooms, deck/shuffling, dealing, suggestions, and accusations) is decoupled from the event‑driven UI. The engine exposes a simple API for advancing turns and validating moves, while the AWT layer handles input (mouse/keyboard) and renders a tile‑based board with clear feedback for legal moves and actions. The result is a compact, deterministic game loop that’s easy to reason about and extend. Packaged as a single runnable JAR for simple distribution, download link below.","link":"/projects/clue","thumbnail":"/assets/images/clue-thumbnail.jpg","stack":["Java","AWT","OOP","EclipseIDE","Git"],"bullets":["Rules Engine: Modeled suspects, rooms, weapons, deck/shuffling, dealing, suggestions, and accusations with clear invariants.","Turn System & State Management: Finite‑state flow for phases (roll/move/suggest/resolve) keeps game logic predictable.","Event‑Driven AWT UI: Mouse/keyboard listeners coordinate with the engine; view updates react to state changes.","Rendering: Tile‑based board drawing using Java AWT with clear highlights for legal moves.","Movement Targets Algorithm: Recursive flood‑fill computes all reachable tiles for a given roll (no diagonal movement), accounting for walls/doors.","Testing: Robust JUnit tests for rules validation, movement targets, and turn transitions.","Collaboration & Git: Pair programmed key features and maintained clean history with branches, PRs, and code reviews.","Packaging & Distribution: Built as a single runnable JAR for simple distribution and easy local play."],"jar_url":"/assets/jars/clue.jar","abstract":"Java AWT desktop adaptation of the classic Clue game. Built a clean rules engine, deterministic turn system, and an event‑driven AWT UI; packaged as a single runnable JAR.","download":{"primaryHref":"/assets/downloads/clue.jar","primaryLabel":"⬇ Download Clue (JAR)","secondaryHref":"https://www.java.com/en/download/manual.jsp","secondaryLabel":"☕ Get Java"}},{"id":3,"slug":"connect-four","title":"Connect Four","description":"A terminal-based Connect Four game implemented in modern C++. Two local players take turns dropping custom tokens into a 7x6 grid, racing to connect four in a row horizontally, vertically, or diagonally. The game alternates who starts each round for fairness, supports replaying multiple rounds in one session, and can export a nicely formatted game log (including each board state and outcomes) to a file. Built with g++ and a Makefile, the target is a statically linked Windows executable for zero-dependency distribution. Note: Windows-only build; the ZIP/EXE may trigger Windows Defender (SmartScreen) security warnings. You may need to choose Keep/Run anyway or unblock the file in Properties to run it.","link":"/games/connect-four","thumbnail":"/assets/images/connectfour-thumbnail.JPG","stack":["C++17","Makefile","Git"],"bullets":["Clear OOP Design: Classes for Game, Board, Player, and CLI handle distinct responsibilities.","Reliable Gameplay Loop: Alternating turns, input validation, and win/draw detection ensure smooth play.","Robust Input Handling: Validates column choices, handles invalid input gracefully, and prompts re-entry.","Accurate Win Detection: Checks horizontal, vertical, and diagonal connections after each move.","Clean Readable UI in Terminal: ASCII board rendering with clear prompts and status updates.","Game Logging: Exports detailed game logs with board states and outcomes to a text file.","Manual Memory Management: Careful use of dynamic memory and exception handling around file I/O.","First Project: My first C++ project, built from scratch to learn the language and OOP principles."],"jar_url":null,"abstract":"Simple terminal-based Connect Four implemented in modern C++. Players can choose their own symbols, and the game features a straightforward ASCII interface.","download":{"primaryHref":"/assets/downloads/ConnectFour.zip","primaryLabel":"⬇ Download Connect Four (ZIP)"}}]